Revit 2024 API
Alignment.Get Method (Document, Guid)
 Returns an Alignment in the document given its GUID.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public static Alignment Get(
	Document document,
	Guid guid
)
Visual Basic
Public Shared Function Get ( _
	document As Document, _
	guid As Guid _
) As Alignment
Visual C++
public:
static Alignment^ Get(
	Document^ document,
	Guid guid
)
Parameters
document
Type: Autodesk.Revit.DB.Document
The document for which the alignment is returned.
guid
Type: System.Guid
The unique identifier of the Alignment.
See Also
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace